In [1]:
import pandas as pd
import numpy as np

In [2]:
index = pd.date_range('1/1/2000', periods=8)
index

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08'],
              dtype='datetime64[ns]', freq='D')

In [3]:
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
s

a   -0.628578
b    0.907180
c    0.180075
d    0.309311
e    0.646465
dtype: float64

In [7]:
df = pd.DataFrame(np.random.randn(8, 3), index=index,columns=['A', 'B', 'C'])
df

                   A         B         C
2000-01-01  0.144470 -0.303530  1.465173
2000-01-02  0.610215 -0.378014  1.757392
2000-01-03  1.042962 -0.173602  0.699287
2000-01-04  0.650474 -1.322865  0.019059
2000-01-05  0.086912  0.168788 -0.356978
2000-01-06  1.885094 -0.111442 -0.915330
2000-01-07  0.247361  0.323963  0.402308
2000-01-08  1.817289 -0.783087  0.603582

In [14]:
df.columns = [x.lower() for x in df.columns]

In [15]:
df

                   a         b         c
2000-01-01  0.144470 -0.303530  1.465173
2000-01-02  0.610215 -0.378014  1.757392
2000-01-03  1.042962 -0.173602  0.699287
2000-01-04  0.650474 -1.322865  0.019059
2000-01-05  0.086912  0.168788 -0.356978
2000-01-06  1.885094 -0.111442 -0.915330
2000-01-07  0.247361  0.323963  0.402308
2000-01-08  1.817289 -0.783087  0.603582

In [42]:
df[['a','b']][:3]

                   a         b
2000-01-01  0.144470 -0.303530
2000-01-02  0.610215 -0.378014
2000-01-03  1.042962 -0.173602

In [71]:
df = pd.DataFrame({'one' : pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
                    'two' : pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
                    'three' : pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})

In [72]:
df

        one     three       two
a -1.845286       NaN -0.037650
b  0.030999 -1.395892 -0.038312
c  0.106703 -1.298465  0.486876
d       NaN -0.662145 -1.047378

In [73]:
row = df.iloc[1]
row

one      0.030999
three   -1.395892
two     -0.038312
Name: b, dtype: float64

In [74]:
column = df['two']
column

a   -0.037650
b   -0.038312
c    0.486876
d   -1.047378
Name: two, dtype: float64

In [75]:
df.sub(row)

        one     three       two
a -1.876285       NaN  0.000662
b  0.000000  0.000000  0.000000
c  0.075704  0.097427  0.525188
d       NaN  0.733748 -1.009067

In [76]:
df.sub(column,axis=0)

        one     three  two
a -1.807637       NaN  0.0
b  0.069310 -1.357581  0.0
c -0.380173 -1.785342  0.0
d       NaN  0.385234  0.0

In [77]:
dfmi = df.copy()
dfmi

        one     three       two
a -1.845286       NaN -0.037650
b  0.030999 -1.395892 -0.038312
c  0.106703 -1.298465  0.486876
d       NaN -0.662145 -1.047378

In [78]:
dfmi.index = pd.MultiIndex.from_tuples([(1,'a'),(1,'b'),(1,'c'),(2,'a')],names=['first','second'])
dfmi

                   one     three       two
first second
1     a      -1.845286       NaN -0.037650
      b       0.030999 -1.395892 -0.038312
      c       0.106703 -1.298465  0.486876
2     a            NaN -0.662145 -1.047378

In [79]:
dfmi.sub(column, axis=0, level='second')

                   one     three       two
first second
1     a      -1.807637       NaN  0.000000
      b       0.069310 -1.357581  0.000000
      c      -0.380173 -1.785342  0.000000
2     a            NaN -0.624495 -1.009729

In [80]:
dfmi.sub(column, axis=0, level='first')

              one  three  two
first second
1     a       NaN    NaN  NaN
      b       NaN    NaN  NaN
      c       NaN    NaN  NaN
2     a       NaN    NaN  NaN

In [81]:
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [82]:
dfmi.index

MultiIndex(levels=[[1, 2], ['a', 'b', 'c']],
           labels=[[0, 0, 0, 1], [0, 1, 2, 0]],
           names=['first', 'second'])

In [83]:
dfmi2=df.copy()
dfmi2.index = pd.MultiIndex.from_tuples([(1,'a','alpha'),(1,'b','beta'),(1,'c','alpha'),(2,'a','alpha')],
                                        names=['first','second','third'])
dfmi2

                         one     three       two
first second third
1     a      alpha -1.845286       NaN -0.037650
      b      beta   0.030999 -1.395892 -0.038312
      c      alpha  0.106703 -1.298465  0.486876
2     a      alpha       NaN -0.662145 -1.047378

In [84]:
dfmi2.index

MultiIndex(levels=[[1, 2], ['a', 'b', 'c'], ['alpha', 'beta']],
           labels=[[0, 0, 0, 1], [0, 1, 2, 0], [0, 1, 0, 0]],
           names=['first', 'second', 'third'])

In [94]:
dfmi2['one']

first  second  third
1      a       alpha   -1.845286
       b       beta     0.030999
       c       alpha    0.106703
2      a       alpha         NaN
Name: one, dtype: float64

In [96]:
s = pd.Series(np.arange(10))
s

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [97]:
div, rem = divmod(s, 3)

In [99]:
div

0    0
1    0
2    0
3    1
4    1
5    1
6    2
7    2
8    2
9    3
dtype: int64

In [100]:
rem

0    0
1    1
2    2
3    0
4    1
5    2
6    0
7    1
8    2
9    0
dtype: int64

In [111]:
idx = pd.Index(np.arange(10,20))
idx

Int64Index([10, 11, 12, 13, 14, 15, 16, 17, 18, 19], dtype='int64')

In [105]:
div, rem = divmod(idx, 3)

In [106]:
div

Int64Index([0, 0, 0, 1, 1, 1, 2, 2, 2, 3], dtype='int64')

In [107]:
rem

Int64Index([0, 1, 2, 0, 1, 2, 0, 1, 2, 0], dtype='int64')

In [108]:
div, rem = divmod(s, [2, 2, 3, 3, 4, 4, 5, 5, 6, 6])

In [109]:
div

0    0
1    0
2    0
3    1
4    1
5    1
6    1
7    1
8    1
9    1
dtype: int64

In [112]:
rem.index = idx
rem

10    0
11    1
12    2
13    0
14    0
15    1
16    1
17    2
18    2
19    3
dtype: int64

In [113]:
df

        one     three       two
a -1.845286       NaN -0.037650
b  0.030999 -1.395892 -0.038312
c  0.106703 -1.298465  0.486876
d       NaN -0.662145 -1.047378

In [116]:
df = pd.DataFrame({'one' : pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
                    'two' : pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
                    'three' : pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})
df

        one     three       two
a -1.336956       NaN -0.962293
b -2.555655  0.081844 -0.227642
c  0.381535 -0.662751 -1.563992
d       NaN  1.665276  0.345513

In [122]:
df2 = pd.DataFrame({'one' : pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
                    'two' : pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
                    'three' : pd.Series(np.random.randn(4), index=['b', 'c', 'd','a'])})
df2

        one     three       two
a -1.281614  2.201036 -0.950468
b  0.353956 -1.420737  0.129264
c  1.344265 -0.879685  0.998493
d       NaN -1.851041       NaN

In [124]:
df3 = pd.DataFrame(np.random.randn(4, 3), index=['a','b','c','d'],columns=['one', 'two', 'three'])
df3

        one       two     three
a  0.589573 -0.376042  1.138690
b  0.738608  0.898357  0.572720
c -0.978269  1.173700  1.214352
d  0.076674  0.104823  0.721170

In [125]:
df + df2

       one     three       two
a -2.61857       NaN -1.912760
b -2.20170 -1.338893 -0.098378
c  1.72580 -1.542437 -0.565499
d      NaN -0.185765       NaN

In [126]:
df.add(df2,fill_value=0)

       one     three       two
a -2.61857  2.201036 -1.912760
b -2.20170 -1.338893 -0.098378
c  1.72580 -1.542437 -0.565499
d      NaN -0.185765  0.345513

In [132]:
df.le(df2)

     one  three    two
a   True  False   True
b   True  False   True
c   True  False   True
d  False  False  False

In [133]:
df[df.le(df2)]

        one  three       two
a -1.336956    NaN -0.962293
b -2.555655    NaN -0.227642
c  0.381535    NaN -1.563992
d       NaN    NaN       NaN

In [139]:
pd.concat([df,df2])

        one     three       two
a -1.336956       NaN -0.962293
b -2.555655  0.081844 -0.227642
c  0.381535 -0.662751 -1.563992
d       NaN  1.665276  0.345513
a -1.281614  2.201036 -0.950468
b  0.353956 -1.420737  0.129264
c  1.344265 -0.879685  0.998493
d       NaN -1.851041       NaN

In [143]:
(df>0).any()

one      True
three    True
two      True
dtype: bool

In [148]:
pd.DataFrame(columns=list('ABC')).empty

True

In [149]:
df2.empty

False

In [150]:
df

        one     three       two
a -1.336956       NaN -0.962293
b -2.555655  0.081844 -0.227642
c  0.381535 -0.662751 -1.563992
d       NaN  1.665276  0.345513

In [151]:
df*2

        one     three       two
a -2.673912       NaN -1.924586
b -5.111310  0.163689 -0.455284
c  0.763069 -1.325503 -3.127984
d       NaN  3.330552  0.691025

In [152]:
df + df == df*2

     one  three   two
a   True  False  True
b   True   True  True
c   True   True  True
d  False   True  True

In [154]:
(df+df).equals(df*2)

True

In [155]:
pd.Series(['foo', 'bar', 'baz']) == pd.Index(['foo', 'bar', 'qux'])

0     True
1     True
2    False
dtype: bool